eye(3);
a = [1 2 3 4 5; 1 2 3 4 5; 1 2 3 4 5];
triu(a, 2);  % 提取第几条主对角线上三角元素
tril(a, 1);   % 提取第几条主对角线下三角元素
rot90(a, 1);  %  矩阵旋转, 后边的数为90的倍数
a.' ;       %  矩阵转置
a';  %  矩阵转置
fliplr(a);    % 左右翻转
flipud(a);     % 上下翻转
A = magic(5);  % 魔方矩阵
d1 = sum(diag(A)); d2=sum(diag(flipud(A)));
disp(d1);
inv(A);  %求逆
B = [1, 2, 3; 1, 4, 9; 1, 8, 27];
b = [5; -2; 6];
% size((inv(B)))
x = inv(B)*b;
rank(B);     %   求秩
det(B);       % 行列式
% --------------------------画出3：20阶魔方矩阵的秩-------------------------
for i = 3 : 20
    r(i) = rank(magic(i));   % 奇数阶魔方矩阵的秩为n， 满秩
end                          % 阶数为4的倍数的魔方矩阵的秩为3
                              % 阶数为2的倍数的魔方矩阵的秩 n/2 + 2
% bar(r)
% grid on
% axis([2, 21, 0, 20])
% -------------------------------------------------------------------------

% --------------------------------矩阵的迹----------------------------------
% 矩阵的迹等于矩阵的对角线元素之和， 也等于矩阵的特征值之和
trace(B);
sum(diag(B));
% -------------------------------------------------------------------------

% -----------------------------向量和矩阵的范数-----------------------------
%   用来度量矩阵在某种意义下的长度
% 向量的范数
% 1范数    向量的绝对值之和
% 2范数    向量的元素的平方和的平方根
% 3范数    所有向量元素绝对值中的最大值
norm(B, 1);
norm(B, 2);
norm(B, inf);
% 矩阵的范数
% 1范数    矩阵列元素绝对值之和的最大值
% 2范数    A'A矩阵的最大特征值的平方根
% 3范数    所有向量元素绝对值之和的最大值
% -------------------------------------------------------------------------


% ------------------------矩阵的条件数--------------------------------------
% 矩阵的条件数等于 矩阵的范数 与 矩阵的逆矩阵的范数 的乘积
% 条件数接近1， 矩阵的性能更好
cond(A, 1);
cond(A, 2);
cond(A, inf);
for n =2: 10
    c(n) = cond(hilb(n));     % 希尔伯特矩阵
end
format long;  % 
c';
% ------------------------------------------------------------------------


% -----------------------矩阵的特征值与特征向量-----------------------------
E = eig(A);   %矩阵的所有特征值
[X, D] = eig(A); % x特征向量，d特征值
A*X(:, 1);
D(1)*X(:, 1);
% x=[0, 0.5, 0.5, 3, 5.5, 5.5, 6, 6, 3, 0; 0, 0, 6, 0, 6, 0, 0, 8, 1, 8];
% A = [1, 0.5; 0, 1];
% y = A*x;
% subplot(2, 2, 1);
% fill(x(1, :), x(2, :), 'r');
% subplot(2,2 , 2);
% fill(y(1, :), y(2, :), 'r');
% -------------------------------------------------------------------------


% -------------------------稀疏矩阵----------------------------------------
% 存储方式
e = sparse(eye(5));
f = full(eye(5));
% spconvert();
% -------------------------------------------------------------------------


% -------------------------------------------------------------------------
%  程序的暂停 pause(n)
% 强行停止   ctrl  + c
C = [1, 4.5; 1, 4.5];
norm(C, 2);
% -------------------------------------------------------------------------


% -------------------------------------------------------------------------
%  输入一个英文单词， 判断是否以元音字母开头
% a = input('请输入单词: ','s');
% switch a(1)
%     case{'A', 'E',  'I',  'O',  'U',  'a',  'e',  'i',  'o',  'u'}
%         disp([a, '以元音字母开头']);
%     otherwise
%         disp([a, '以辅音字母开头']);
% end
% -------------------------------------------------------------------------
 
% -------------------------------------------------------------------------
% 计算圆周率pi的值

% 1。无穷级数
y = 0;  g = -1;  
% n = input('n=?');
% for i = 1: n
%     g = -g;
%     y = y + g * 1 /(2 * i - 1);
% end
pai = 4 * y;


% 2。积分的方式求解(效率低)
% a = 0; 
% b = 1; 
% n = input('n=?');
% h = (b - a) / n;
% x = a: h: b;
% f = sqrt(1 - x.* x);
% s = [];
% for k = 1: n
%     s1 = (f(k) + f(k+1)) * h/ 2;
%     s = [s, s1];
% end
% pai = 4 * sum(s);

% 3.蒙特卡罗 (同样的数下， 精确度不足)
% s = 0;
% n = input('n=?');
% for i = 1: n
%     x = rand(1);
%     y = rand(1);
%     if x^2 + y^2 <= 1
%         s = s + 1;
%     end
% end
% pai = 4 * s / n

% -------------------------------------------------------------------------


% -------------------------------------------------------------------------
% subplot(2, 2, 1)
% fplot(@(x) sin(1./x), [0, 0.2], 'r');
% subplot(2, 2, 2)
% fplot(@(t) t.*sin(t), @(t) t.*cos(t), [0, 10*pi], 'r')

%     -----------title-----latex格式控制符
% {\omega}  w     
% {\geq}  >=
% e^{a}   e^a
%x_{1}    x1
%  \bf:   加粗
%  \it   斜体
% rm    正体
%  beta   
% subplot(221)
% x = -2 * pi: 0.005: 2*pi;
% y = sin(x);
% plot(x, y);
% title('y = sin(x)');
% xlabel('-2\pi\leq x \leq 2\pi');
% text(3, 0.28, 'leftarrow sin(x)');
% 
% subplot(222)
% x = linspace(0, 2*pi, 1000);
% plot(x, [sin(x); sin(2*x); sin(3*x)]);
% legend('sin(x)', 'sin(2*x)', 'sin(3*x)');
% 
 subplot(223)
 t = linspace(0, 2*pi, 100);
 x = sin(t); y = cos(t);
 plot(x, y, 'b-');
 hold on
 plot(2*x, 2*y, 'r--')
 axis([-2.2, 2.2, -2.2, 2.2])
 grid on
 axis equal
% -----------------------------对数坐标--------------------------------------------





















